Flow past a circular cylinder/Laminar_at_Re_of_100/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01; // podaci zadati u cm

vertices
(
    (-24 -4 -1)
    (-1.414214 -4 -1)
    ( 1.414214 -4 -1)
    (80 -4 -1)
    (80 -1.414214 -1)
    (80 1.414214 -1)
    (80 4.2 -1)
    ( 1.414214 4.2 -1)
	(-1.414214 4.2 -1)
	(-24 4.2 -1)
	(-24 1.414214 -1)
	(-24 -1.414214 -1)
	
	(-1.414214 -1.414214 -1)
	( 1.414214 -1.414214 -1)
	( 1.414214  1.414214 -1)
	(-1.414214  1.414214 -1)
	(-0.707107  0.707107 -1)
	(-0.707107 -0.707107 -1)
	( 0.707107 -0.707107 -1)
	( 0.707107  0.707107 -1)
	
	
	(-24 -4 1)
    (-1.414214 -4 1)
    ( 1.414214 -4 1)
    (80 -4 1)
    (80 -1.414214 1)
    (80 1.414214 1)
    (80 4.2 1)
    ( 1.414214 4.2 1)
	(-1.414214 4.2 1)
	(-24 4.2 1)
	(-24 1.414214 1)
	(-24 -1.414214 1)
	
	(-1.414214 -1.414214 1)
	( 1.414214 -1.414214 1)
	( 1.414214  1.414214 1)
	(-1.414214  1.414214 1)
	(-0.707107  0.707107 1)
	(-0.707107 -0.707107 1)
	( 0.707107 -0.707107 1)
	( 0.707107  0.707107 1)
);

blocks
(
    hex (0 1 12 11 20 21 32 31) (80 20 1) simpleGrading (1 1 1) // 0
	hex (1 2 13 12 21 22 33 32) (20 20 1) simpleGrading (1 1 1) // 1
	hex (2 3 4  13 22 23 24 33) (200 20 1) simpleGrading (15 1 1) // 2
	hex (13 4 5 14 33 24 25 34) (200 20 1) simpleGrading (15 1 1) // 7
	hex (14 5 6  7 34 25 26 27) (200 20 1) simpleGrading (15 1 1) // 11 
	hex (15 14 7 8 35 34 27 28) (20 20 1) simpleGrading (1 1 1) // 10
	hex (10 15 8 9 30 35 28 29) (80 20 1) simpleGrading (1 1 1) // 8
	hex (11 12 15 10 31 32 35 30) (80 20 1) simpleGrading (1 1 1) // 3
	
	hex (12 13 18 17 32 33 38 37) (20 20 1) simpleGrading (1 1 1) // 5
	hex (18 13 14 19 38 33 34 39) (20 20 1) simpleGrading (1 1 1) // 6
	hex (19 14 15 16 39 34 35 36) (20 20 1) simpleGrading (1 1 1) // 9
	hex (12 17 16 15 32 37 36 35) (20 20 1) simpleGrading (1 1 1) // 4
);

edges
(
	arc 12 13 (0 -2 -1)
	arc 13 14 (2  0 -1)
	arc 14 15 (0  2 -1)
	arc 15 12 (-2 0 -1)
	
	arc 17 18 (0 -1 -1)
	arc 18 19 (1  0 -1)
	arc 19 16 (0  1 -1)
	arc 16 17 (-1 0 -1)
	
	
	arc 32 33 (0 -2 1)
	arc 33 34 (2  0 1)
	arc 34 35 (0  2 1)
	arc 35 32 (-2 0 1)
	
	arc 37 38 (0 -1 1)
	arc 38 39 (1  0 1)
	arc 39 36 (0  1 1)
	arc 36 37 (-1 0 1)
);

boundary
(
    ulaz
	{
		type patch;
		faces
		(
			(11 0 20 31)
			(10 11 30 31)
			(9 10 30 29)
		);
	}
	
	izlaz
	{
		type patch;
		faces
		(
			(3 4 24 23)
			(4 5 25 24)
			(5 6 26 25)
		);
	}
	
	gornjiZid
	{
		type wall;
		faces
		(
			(6 7 27 26)
			(7 8 28 27)
			(8 9 29 28)
		);
	}
	
	donjiZid
	{
		type wall;
		faces
		(
			(0 1 21 20)
			(1 2 22 21)
			(2 3 23 22)
		);
	}
	
	cilindar
	{
		type wall;
		faces
		(
			(19 16 36 39)
			(16 17 37 36)
			(17 18 38 37)
			(18 19 38 39)
		);
	}
	
	empty
    {
        type empty;
        faces
        (
            (9 8 15 10)
			(8 7 14 15)
			(7 6 5 14)
			(10 15 12 11)
			(15 14 19 16)
			(15 16 17 12)
			//(16 19 18 17) //
			(17 18 13 12)
			(19 14 13 18) 
			(14 5 4 13)
			(11 12 1 0)
			(12 13 2 1)
			(13 4 3 2)
			
			
        );
    }
	
	empty2
	{
		type empty;
		faces
		(
			(23 24 33 22)
			(33 32 21 22)
			(32 31 20 21)
			(24 25 34 33) 
			(34 39 38 33)
			(34 35 36 39)
			//(39 36 37 38) //
			(38 37 32 33)
			(36 35 32 37)
			(35 30 31 32)
			(26 27 34 25)
			(27 28 35 34)
			(28 29 30 35)
		);
	}
);


// ************************************************************************* //
